In [7]:
import pandas as pd

In [8]:
cols = ["Name", "Time", "Date"]
df = pd.read_csv("Attendance.csv", names = cols)

In [9]:
df.head()

          Name       Time                Date
0  ABDUL SAMAD   13:13:43   10/20/22/10/2022
1  ABDUL SAMAD   13:13:44   10/20/22/10/2022
2  ABDUL SAMAD   13:13:45   10/20/22/10/2022
3  ABDUL SAMAD   13:13:45   10/20/22/10/2022
4  ABDUL SAMAD   13:13:45   10/20/22/10/2022

In [10]:
df1 = df.drop_duplicates(subset=['Name']).reset_index(drop=True)

In [11]:
df1

           Name       Time                Date
0   ABDUL SAMAD   13:13:43   10/20/22/10/2022
1    EKTA GUJAR   13:16:57   10/20/22/10/2022
2  SINDURA DASI   13:17:05   10/20/22/10/2022

In [12]:
df1.to_csv('clean.csv')